In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [28]:
### TITANIC DATASET - PREPROCESSED IN SQL 
from sqlalchemy import create_engine
sqlcon = create_engine('mssql+pyodbc://@' + 'GHOST-117\SQLEXPRESS' + '/' + 'MOHSIN' + '?trusted_connection=yes&driver=ODBC+Driver+13+for+SQL+Server')

# Import with index/ID as column1, to keep the order the same:
df = pd.read_sql_query("SELECT DISTINCT PassengerId, Pclass,male,Age,Fare,Survived FROM  MOHSIN.DBO.TITANIC_PREPROCESSED", sqlcon)

# Drop ID column and split X,y
# X variables
inputs = df[['Pclass','male','Age','Fare']]
# y variable
target = df[['Survived']]

In [30]:
inputs.head(3)

   Pclass  male   Age     Fare
0       3     1  22.0   7.2500
1       1     0  38.0  71.2833
2       3     0  26.0   7.9250

In [31]:
target.head(3)

   Survived
0         0
1         1
2         1

In [32]:
## split train/test ( !!! use stratified for real dataset of this small size !!!)
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs, target, test_size=0.2)

In [33]:
len(X_train)

712

In [35]:
############ Create the model
############ Using Gaussian NB, when data distribution is 'normal' (bell curve)

from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

# Train the model
model.fit(X_train,y_train)

X:\Anaconda\lib\site-packages\sklearn\utils\validation.py:724: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

GaussianNB(priors=None, var_smoothing=1e-09)

In [36]:
model.score(X_test,y_test)

0.7932960893854749

In [37]:
X_test[:10]

     Pclass  male   Age     Fare
615       2     0  24.0  65.0000
287       3     1  22.0   7.8958
886       2     1  27.0  13.0000
486       1     0  35.0  90.0000
124       1     1  54.0  77.2875
612       3     0  30.0  15.5000
16        3     1   2.0  29.1250
703       3     1  25.0   7.7417
275       1     0  63.0  77.9583
697       3     0  30.0   7.7333

In [38]:
y_test[:10]

     Survived
615         1
287         0
886         0
486         1
124         0
612         1
16          0
703         0
275         1
697         1

In [39]:
model.predict(X_test[:10])

array([1, 0, 0, 1, 1, 0, 0, 0, 1, 0], dtype=int64)

In [41]:
# Shows the probability for each passenger:
# first column for prediction for death, second is probability for surviving
model.predict_proba(X_test[:10])

array([[0.1360892 , 0.8639108 ],
       [0.95777325, 0.04222675],
       [0.91677596, 0.08322404],
       [0.01299784, 0.98700216],
       [0.37364286, 0.62635714],
       [0.52520996, 0.47479004],
       [0.918785  , 0.081215  ],
       [0.95998978, 0.04001022],
       [0.02045976, 0.97954024],
       [0.52188465, 0.47811535]])